cf_billing/Documents/бестПлатежноеПоручениеВходящееЮрЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестПлатежноеПоручениеВходящееЮрЛица</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бестАвансы</xr:Item>
				<xr:Item>InformationRegister.бестИсторияОплатыЮрЛиц</xr:Item>
				<xr:Item>AccumulationRegister.бестВзаиморасчётыПоСФЮрЛица</xr:Item>
				<xr:Item>AccumulationRegister.бестАвансыИспользованные</xr:Item>
				<xr:Item>AccumulationRegister.бестАвансыПоступившие</xr:Item>
				<xr:Item>AccumulationRegister.бестОплатаУслуг</xr:Item>
				<xr:Item>AccumulationRegister.бестВзаиморасчётыПоУслугамЮрЛица</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргИсточникиПоступления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлДляЧтения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерППВERP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПоДокументу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бестСтатусыПлатежныхДокументов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НеЗагруженныеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОписаниеОшибки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПлатежногоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежногоДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначениеПлатежа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИОПлательщика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументНачисления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бестРеализацияЮрЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИОПлательщика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначениеПлатежа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежногоДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПлатежногоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаспределениеОплатыПоУслугам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументНачисления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бестНачислениеНП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИОПлательщика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначениеПлатежа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежногоДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПлатежногоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/AccumulationRegisters/бестОплатаУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бестОплатаУслуг</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргИсточникиПоступления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестИсторияОплатыЮрЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестИсторияОплатыЮрЛиц</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПлатежногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Documents/бестПлатежноеПоручениеВходящееЮрЛица/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ДанныеОплаты(НачалоПериодаРасчета) Экспорт	
				
	Запрос  				= Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериодаРасчета",	НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("Ссылка",					Ссылка);
	Запрос.Текст 			= 
	"ВЫБРАТЬ
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.Услуга КАК Услуга,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.Поставщик КАК Поставщик,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.Договор КАК Договор,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.Ссылка.Организация КАК Организация,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.Ссылка.Район КАК Район,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.Ссылка.ПериодНачисления КАК ПериодНачисления,
	|	СУММА(бестПлатежноеПоручениеВходящееЮрЛицаОплата.СуммаОплаты) КАК СуммаОплаты,
	|	ВЫБОР
	|		КОГДА бестПлатежноеПоручениеВходящееЮрЛицаОплата.ДатаПлатежногоДокумента < &НачалоПериодаРасчета
	|			ТОГДА &НачалоПериодаРасчета
	|		ИНАЧЕ бестПлатежноеПоручениеВходящееЮрЛицаОплата.ДатаПлатежногоДокумента
	|	КОНЕЦ КАК Дата,
	|	ВЫБОР
	|		КОГДА бестПлатежноеПоручениеВходящееЮрЛицаОплата.ДатаПлатежногоДокумента < &НачалоПериодаРасчета
	|			ТОГДА &НачалоПериодаРасчета
	|		ИНАЧЕ бестПлатежноеПоручениеВходящееЮрЛицаОплата.ДатаПлатежногоДокумента
	|	КОНЕЦ КАК Период,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.ПериодОплаты КАК ПериодВзаиморасчетов,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.ПериодОплаты КАК ПериодВзаиморасчетовОкончание,
	|	ИСТИНА КАК ЭтоОплата
	|ИЗ
	|	Документ.бестПлатежноеПоручениеВходящееЮрЛица.Оплата КАК бестПлатежноеПоручениеВходящееЮрЛицаОплата
	|ГДЕ
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА бестПлатежноеПоручениеВходящееЮрЛицаОплата.ДатаПлатежногоДокумента < &НачалоПериодаРасчета
	|			ТОГДА &НачалоПериодаРасчета
	|		ИНАЧЕ бестПлатежноеПоручениеВходящееЮрЛицаОплата.ДатаПлатежногоДокумента
	|	КОНЕЦ,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.Ссылка.Организация,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.Ссылка.ПериодНачисления,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.Поставщик,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.Договор,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.Ссылка.Район,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.Услуга,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.ПериодОплаты,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.ПериодОплаты,
	|	ВЫБОР
	|		КОГДА бестПлатежноеПоручениеВходящееЮрЛицаОплата.ДатаПлатежногоДокумента < &НачалоПериодаРасчета
	|			ТОГДА &НачалоПериодаРасчета
	|		ИНАЧЕ бестПлатежноеПоручениеВходящееЮрЛицаОплата.ДатаПлатежногоДокумента
	|	КОНЕЦ";
	
	Результат  		= Запрос.Выполнить();
	Возврат Результат;	 
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный 			= Пользователи.ТекущийПользователь();
	СуммаПоДокументу = Оплата.Итог("СуммаОплаты"); 
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;
	
	ГраницыПериода  		= Обработки.бестГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПериодНачисления);
	
	НачалоПериодаРасчета	= ГраницыПериода.НачалоОП;
		
	ДополнительныеСвойства.Вставить("ИсточникПоступления",	ИсточникПоступления);
	ДополнительныеСвойства.Вставить("НачалоПериодаРасчета",	НачалоПериодаРасчета);
	ДополнительныеСвойства.Вставить("ДанныеОплаты",			ДанныеОплаты(НачалоПериодаРасчета));
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	ДанныеОплаты 					= ДополнительныеСвойства.ДанныеОплаты;
	ВыборкаОплата  					= ДанныеОплаты.выбрать();
	
	Пока ВыборкаОплата.следующий() цикл
		
		Запись 						= Движения.бестОплатаУслуг.Добавить();	
		ЗаполнитьЗначенияСвойств(Запись,ВыборкаОплата);
		Запись.Сумма 				= ВыборкаОплата.СуммаОплаты;
		Запись.ИсточникПоступления	= ИсточникПоступления;
	КонецЦикла; 
	
	ЗаписьВРегистры();
	
	ДвижСуд = Движения.бестЗадолженностьПоРешениюСуда;
	
	ДвижСуд.Записывать = Истина;
	ВыборкаОплатаСуд = ПолучитьДанныеСудОплаты().Выбрать();
	
		
	Пока ВыборкаОплатаСуд.Следующий() Цикл
		Запись 						= ДвижСуд.ДобавитьРасход();	
		ЗаполнитьЗначенияСвойств(Запись,ВыборкаОплатаСуд);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписьВРегистры()
	
	ДанныеШапки 			= ПолучитьДанныеШапки();
	ДанныеТаблицы 			= ПолучитьДанныеТаблицы();
	
	ЗаписьВРСИсторияОплатыЮрЛиц(Движения, ДанныеШапки, ДанныеТаблицы.Выбрать());	
	
КонецПроцедуры

Процедура ЗаписьВРСИсторияОплатыЮрЛиц(Движения, ДанныеШапки, ДанныеТаблицы)
	Набор  							= Движения.бестИсторияОплатыЮрЛиц;
	Пока ДанныеТаблицы.Следующий() Цикл
		Запись 						= Набор.Добавить();	
		ЗаполнитьЗначенияСвойств(Запись,ДанныеШапки);
		ЗаполнитьЗначенияСвойств(Запись,ДанныеТаблицы);
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьДанныеШапки()
	ДанныеШапки  = Новый Структура;
	ДанныеШапки.Вставить("Документ", 				Ссылка);
	ДанныеШапки.Вставить("Организация",	 			Организация);
	ДанныеШапки.Вставить("Район",	 				Район);
	ДанныеШапки.Вставить("Период",	 				Дата);
	ДанныеШапки.Вставить("ПериодРегистрации",		Дата);
	ДанныеШапки.Вставить("ПериодНачисления",		ПериодНачисления);	
	ДанныеШапки.Вставить("ИсточникПоступления",		ИсточникПоступления);
		
	Возврат ДанныеШапки;
КонецФункции

Функция ПолучитьДанныеТаблицы()
			
	Запрос  				= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст 			= 
	"ВЫБРАТЬ
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.Ссылка КАК Ссылка,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.Контрагент КАК Контрагент,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.Договор КАК Договор,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.ДокументНачисления КАК ДокументНачисления,
	|	СУММА(бестПлатежноеПоручениеВходящееЮрЛицаОплата.СуммаОплаты) КАК СуммаОплаты,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.ФИОПлательщика КАК ФИОПлательщика,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.НазначениеПлатежа КАК НазначениеПлатежа,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.ДатаПлатежногоДокумента КАК ДатаПлатежногоДокумента,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.НомерПлатежногоДокумента КАК НомерПлатежногоДокумента,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.Примечание КАК Примечание,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.Услуга КАК Услуга,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.Поставщик КАК Поставщик,
	|	энргДоговорыКонтрагентов.Район КАК Район
	|ПОМЕСТИТЬ ВрТ0
	|ИЗ
	|	Документ.бестПлатежноеПоручениеВходящееЮрЛица.Оплата КАК бестПлатежноеПоручениеВходящееЮрЛицаОплата
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|		ПО бестПлатежноеПоручениеВходящееЮрЛицаОплата.Договор = энргДоговорыКонтрагентов.Ссылка
	|			И (НЕ энргДоговорыКонтрагентов.ПометкаУдаления)
	|ГДЕ
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.Ссылка,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.НазначениеПлатежа,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.ДатаПлатежногоДокумента,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.НомерПлатежногоДокумента,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.Примечание,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.Услуга,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.Поставщик,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.Контрагент,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.Договор,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.ДокументНачисления,
	|	бестПлатежноеПоручениеВходящееЮрЛицаОплата.ФИОПлательщика,
	|	энргДоговорыКонтрагентов.Район
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТ0.Ссылка КАК Ссылка,
	|	ВрТ0.Контрагент КАК Контрагент,
	|	ВрТ0.Договор КАК Договор,
	|	СУММА(ВрТ0.СуммаОплаты) КАК СуммаПлатежа,
	|	ВрТ0.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ВрТ0.ДатаПлатежногоДокумента КАК ДатаПлатежногоДокумента,
	|	ВрТ0.НомерПлатежногоДокумента КАК НомерПлатежногоДокумента,
	|	ВрТ0.Район КАК Район
	|ИЗ
	|	ВрТ0 КАК ВрТ0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВрТ0.ДатаПлатежногоДокумента,
	|	ВрТ0.НазначениеПлатежа,
	|	ВрТ0.Ссылка,
	|	ВрТ0.Контрагент,
	|	ВрТ0.Договор,
	|	ВрТ0.НомерПлатежногоДокумента,
	|	ВрТ0.Район";	
	Результат  		= Запрос.Выполнить();
	Возврат Результат;	 
КонецФункции

Функция ПолучитьДанныеСудОплаты()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестПлатежноеПоручениеВходящееЮрЛицаОплатаСудебнойЗадолженности.Договор КАК Договор,
		|	бестПлатежноеПоручениеВходящееЮрЛицаОплатаСудебнойЗадолженности.ПериодНачисления КАК ПериодНачисления,
		|	бестПлатежноеПоручениеВходящееЮрЛицаОплатаСудебнойЗадолженности.ВидДолга КАК ВидДолга,
		|	бестПлатежноеПоручениеВходящееЮрЛицаОплатаСудебнойЗадолженности.Сумма КАК Сумма,
		|	бестПлатежноеПоручениеВходящееЮрЛица.Организация КАК Организация,
		|	бестПлатежноеПоручениеВходящееЮрЛица.Район КАК Район,
		|	бестПлатежноеПоручениеВходящееЮрЛица.Дата КАК Период
		|ИЗ
		|	Документ.бестПлатежноеПоручениеВходящееЮрЛица.ОплатаСудебнойЗадолженности КАК бестПлатежноеПоручениеВходящееЮрЛицаОплатаСудебнойЗадолженности
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестПлатежноеПоручениеВходящееЮрЛица КАК бестПлатежноеПоручениеВходящееЮрЛица
		|		ПО бестПлатежноеПоручениеВходящееЮрЛицаОплатаСудебнойЗадолженности.Ссылка = бестПлатежноеПоручениеВходящееЮрЛица.Ссылка
		|ГДЕ
		|	бестПлатежноеПоручениеВходящееЮрЛица.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить();
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
